# vLLM backend — hosts Qwen2.5-7B-Instruct with sql-expert and creative LoRA adapters.
# Decoupled mode required for token streaming.
# Engine parameters are in 1/model.json.

name: "vllm_engine"
backend: "vllm"
max_batch_size: 0   # vLLM manages batching internally

model_transaction_policy {
  decoupled: true   # required for streaming token-by-token responses
}

input [
  {
    name: "text_input"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "stream"
    data_type: TYPE_BOOL
    dims: [ 1 ]
  },
  {
    name: "sampling_parameters"
    data_type: TYPE_STRING
    dims: [ 1 ]
    optional: true
  },
  {
    name: "exclude_input_in_output"
    data_type: TYPE_BOOL
    dims: [ 1 ]
    optional: true
  }
]

output [
  {
    name: "text_output"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

instance_group [
  {
    kind: KIND_MODEL
    count: 1
  }
]
