# Router BLS — Python Business Logic Scripting backend.
# Classifies incoming prompts, then calls vllm_engine with the right LoRA adapter.
# Decoupled mode streams tokens as they arrive from vllm_engine.

name: "router_bls"
backend: "python"
max_batch_size: 0   # decoupled, handles one request per thread

model_transaction_policy {
  decoupled: true
}

input [
  {
    name: "prompt"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "stream"
    data_type: TYPE_BOOL
    dims: [ 1 ]
    optional: true
  },
  {
    name: "max_tokens"
    data_type: TYPE_INT32
    dims: [ 1 ]
    optional: true
  },
  {
    name: "temperature"
    data_type: TYPE_FP32
    dims: [ 1 ]
    optional: true
  }
]

output [
  {
    name: "response"
    data_type: TYPE_STRING
    dims: [ -1 ]
  },
  {
    name: "intent"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
